/****************************************Copyright (c)****************************************************
**                         SHENZHEN DECARD TECHNOLOGIES Co.,LTD.                               
**                                     
**                               http://www.decard.com
**
**--------------File Info---------------------------------------------------------------------------------
** Create by:			xp
** Create date:			2012-05-18
** Version:             1.0
** Descriptions:		IAP升级
**--------------File Info---------------------------------------------------------------------------------
** Modify by:			
** Modify date:			
** Version:             
** Descriptions:	
*********************************************************************************************************/

#ifndef		_IAP_
#define		_IAP_

#include "stm32l1xx_hal.h"

#define	IAP_OK				0
#define	IAP_LEN_UNSUPPORTED	1
#define	IAP_ERASE_ERROR		3
#define	IAP_PROGRAM_ERROR	4


extern uint32_t iap_program_address;

/*********************************************************************************************************
**							外部引用函数
*********************************************************************************************************/
/********************************************************************************************************
** 函数功能：使用芯片FLASH作为EEPROM使用，读数据
** 参    数：addr：地址
			 len： 长度
			 buff：读取数据
** 返    回：0：读取成功
			 1：参数错误
*********************************************************************************************************/

uint32_t STMFLASH_ReadfWord(uint32_t faddr);
void STMFLASH_ReadBuffer(uint32_t addr, uint8_t *buf, uint32_t length);

uint8_t xm_iap_program(uint32_t base_addr,uint32_t addr_offset, uint32_t len, uint8_t* buff);

#endif
/*********************************************************************************************************
**                            End Of File
*********************************************************************************************************/


